# python-database-analysis 0.0.1
Скрипт предоставляет инструмент для анализа базы данных (сверка таблиц в базе данных)
Возможности:
- построчная проверка таблицы на наличие в строке записи подходящей под заданный паттерн
- автоматическая проверка искомого патерна в нескольких таблицах
- внесение записи-индикатора в основную базу данных (в соответствии с заданными условиями)

# Следующее обновление: python-database-analysis 0.0.2
Что запланировано добавить:
- исключение небезопасного метода подключения к DB ([хранение данных для подключения внутри кода)
- внедрение GUI
- возможность внесения данных для подключения DB в оконном режиме
- отображения схемы бд (таблицы и колонки)
- основные инструменты администратора DB
- возможность внесения условий для работы скрипта в GUI режиме
- возможность выбора таблиц, колонок DB для работы скрипта
